Repository: JcDenis/tweakStores
Catalog: locales/*/main.po
Languages: fr

source: Copied to clipboard
fr: Copié dans le presse-papier

source: Module to parse:
fr: Module à traiter :

source: This module has no repository set in its _define.php file.
fr: Ce module n'a aucun dépôt tiers définie dans son fichier _define.php

source: Failed to read third party repository
fr: Impossible de lire le dépôt tiers

source: Tweak third-party repositories
fr: Gestion de dépôts tiers

source: There is no module to tweak
fr: Il n'y a pas de module à gérer

source: Contents from distant repositiory
fr: Contenu provenant du dépôt distant

source: Contents generated from local module definiton
fr: Contenu généré depuis la définition locale du module

source: Failed to parse XML code: %s
fr: Impossible de traiter le code XML : %s

source: Code is not fully filled: %s
fr: Le code n'est pas complet : %s

source: File successfully writed
fr: Fichier écrit avec succès

source: Code is complete
fr: Le code est complet

source: Save to module directory
fr: Enregistrer dans le répertoire du module

source: Copy to clipboard
fr: Copier dans le presse-papier

source: Check
fr: Obtenir

source: You must configure zip file pattern to complete xml code automatically.
fr: Vous devez configurer le modèle de fichier zip pour compléter le code XML automatiquement.

source: Predictable URL to zip file on the external repository
fr: URL prédictive du fichier zip sur le dépôt externe

source: You can use widcard like %author%, %type%, %id%, %version%.
fr: Vous pouvez utiliser les remplacements automatiques tels que %author%, %type%, %id%, %version%.

source: For example on github https://github.com/MyGitName/%id%/releases/download/v%version%/%type%-%id%.zip
fr: Par exemple sur github https://github.com/MyGitName/%id%/releases/download/v%version%/%type%-%id%.zip

source: Note: on github, you must create a release and join to it the module zip file.
fr: Note : sur github, vous devez créer un release et y joindre le fichier zip du module.

source: Enable packman behaviors
fr: Activer les comportements avec pacKman

source: If enabled, plugin pacKman will (re)generate on the fly dcstore.xml file at root directory of the module.
fr: Si activé, le plugin pacKman (re)génèrera à la volée le fichier dcstore.xml

source: Select a module
fr: Sélectionner un module

source: Enable plugin
fr: Activer le plugin

source: Helper to manage external repositories
fr: Aide à la gestion de dépôts externes
